package _刷题.lx_LanqiaoBei;

import java.util.Scanner;

/**
 * 题目：
 * http://lx.lanqiao.cn/problem.page?gpid=T776
 * 为什么是这个矩阵：
 * https://www.cnblogs.com/MMMMMMMW/p/12300262.html
 * 懂了
 * <p>
 * 与2014年A09_斐波那契类似
 * <p>
 * 题目:
 * 集合M至少有两个元素（实数），且M中任意两个元素差的绝对值都大于2，
 * 则称M为“翔集合”，已知集合S={1,2...,n},请求出n的子集中共有多少个翔集合。
 */

/**
 * 矩阵乘法，与斐波拉契封闭解差不多
 * 打表:
 * 1 0
 * 2 0
 * 3 0
 * 4 1            {1,4}
 * 5 2+1          {1,4}--{1,5} {2,5}
 * 6 3+2+1        {1,4}--{1,6} {2,5}--{2,6} {3,6}
 * 7 4+3+2+1      {1,4}--{1,7} {2,5}--{2.7} {3,6}--{3,7}  {4,7}
 * 8 5+4+3+2+1    {1,4}--{1,8} {2,5}--{2,8} {3,6}--{3,8}  {4,7}--{4,8} {5,8}
 * 9 6+5+4+3+2+1  {1,4}--{1,9} {2,5}--{2,9} {3,6}--{3,9}  {4,7}--{4,9} {5,8}--{5,9} {6,9}
 * 递推方程式:
 * f(n) = Σ (n-3)
 */

public class ADV_375_翔集合 {
    /**
     * 答案要余1000007
     * @param args
     */
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        long n = sc.nextLong();
    }
}
